; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v7 ?v8)
             (pred_4 ?v6 ?v5)
             (pred_8 ?v7 ?v5)
             (pred_5 ?v4 ?v7 )
	     (pred_7 ?v7)
             (pred_2 ?v3)
             (pred_3 ?v6)
             (pred_6 ?v5)
             (pred_9 ?v7)
             (pred_10 ?v6)
             (pred_12 ?v7)
             (pred_11 ))



(:action op_3
:parameters (?v13 ?v10 ?v11 ?v2)
:precondition (and (pred_2 ?v13) (pred_2 ?v10) (pred_3 ?v11) (pred_6 ?v2)
          (pred_1 ?v13 ?v10) (pred_4 ?v11 ?v2)
                   (pred_8 ?v10 ?v2) (pred_7 ?v13) 
                   (pred_9 ?v10) (pred_10 ?v11))
:effect (and  (pred_12 ?v10) (not (pred_9 ?v10))))


(:action op_1
:parameters (?v13 ?v12)
:precondition (and (pred_2 ?v13) (pred_2 ?v12)
               (pred_7 ?v13) (pred_1 ?v13 ?v12) (pred_12 ?v12))
:effect (and (pred_7 ?v12) (not (pred_7 ?v13))))

(:action op_2
:parameters (?v13 ?v11)
:precondition (and (pred_2 ?v13) (pred_3 ?v11) 
                  (pred_7 ?v13) (pred_5 ?v11 ?v13) (pred_11 ))
:effect (and (pred_10 ?v11)
   (not (pred_5 ?v11 ?v13)) (not (pred_11 ))))


(:action op_4
:parameters (?v13 ?v1 ?v9)
:precondition (and (pred_2 ?v13) (pred_3 ?v1) (pred_3 ?v9)
                  (pred_7 ?v13) (pred_10 ?v9) (pred_5 ?v1 ?v13))
:effect (and (pred_10 ?v1) (pred_5 ?v9 ?v13)
        (not (pred_10 ?v9)) (not (pred_5 ?v1 ?v13))))

(:action op_5
:parameters (?v13 ?v11)
:precondition (and (pred_2 ?v13) (pred_3 ?v11) 
                  (pred_7 ?v13) (pred_10 ?v11))
:effect (and (pred_11 ) (pred_5 ?v11 ?v13) (not (pred_10 ?v11)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_01 obj_13 obj_07 obj_03 obj_19 obj_08 obj_12 obj_04 obj_11 obj_10 obj_18 obj_20 obj_05 obj_17 obj_02 obj_14
    obj_06 obj_16
    obj_09 obj_15
    )

    (:init
       (pred_11)

       (pred_2 obj_01)
       (pred_2 obj_13)
       (pred_2 obj_07)
       (pred_2 obj_03)
       (pred_2 obj_19)
       (pred_2 obj_08)
       (pred_2 obj_12)
       (pred_2 obj_04)
       (pred_2 obj_11)
       (pred_2 obj_10)
       (pred_2 obj_18)
       (pred_2 obj_20)
       (pred_2 obj_05)
       (pred_2 obj_17)
       (pred_2 obj_02)
       (pred_2 obj_14)
       (pred_6 obj_06)
       (pred_6 obj_16)
       (pred_3 obj_09)
       (pred_3 obj_15)

       (pred_1 obj_01 obj_19)
       (pred_1 obj_01 obj_13)
       (pred_1 obj_13 obj_08)
       (pred_1 obj_13 obj_07)
       (pred_1 obj_13 obj_01)
       (pred_1 obj_07 obj_12)
       (pred_1 obj_07 obj_03)
       (pred_1 obj_07 obj_13)
       (pred_1 obj_03 obj_04)
       (pred_1 obj_03 obj_07)
       (pred_1 obj_19 obj_11)
       (pred_1 obj_19 obj_08)
       (pred_1 obj_19 obj_01)
       (pred_1 obj_08 obj_10)
       (pred_1 obj_08 obj_12)
       (pred_1 obj_08 obj_13)
       (pred_1 obj_08 obj_19)
       (pred_1 obj_12 obj_18)
       (pred_1 obj_12 obj_04)
       (pred_1 obj_12 obj_07)
       (pred_1 obj_12 obj_08)
       (pred_1 obj_04 obj_20)
       (pred_1 obj_04 obj_03)
       (pred_1 obj_04 obj_12)
       (pred_1 obj_11 obj_05)
       (pred_1 obj_11 obj_10)
       (pred_1 obj_11 obj_19)
       (pred_1 obj_10 obj_17)
       (pred_1 obj_10 obj_18)
       (pred_1 obj_10 obj_08)
       (pred_1 obj_10 obj_11)
       (pred_1 obj_18 obj_02)
       (pred_1 obj_18 obj_20)
       (pred_1 obj_18 obj_12)
       (pred_1 obj_18 obj_10)
       (pred_1 obj_20 obj_14)
       (pred_1 obj_20 obj_04)
       (pred_1 obj_20 obj_18)
       (pred_1 obj_05 obj_17)
       (pred_1 obj_05 obj_11)
       (pred_1 obj_17 obj_02)
       (pred_1 obj_17 obj_10)
       (pred_1 obj_17 obj_05)
       (pred_1 obj_02 obj_14)
       (pred_1 obj_02 obj_18)
       (pred_1 obj_02 obj_17)
       (pred_1 obj_14 obj_20)
       (pred_1 obj_14 obj_02)
       (pred_9 obj_02)
       (pred_9 obj_03)
       (pred_8  obj_02 obj_06)
       (pred_8  obj_03 obj_16)
       (pred_12 obj_01)
       (pred_12 obj_13)
       (pred_12 obj_07)
       (pred_12 obj_19)
       (pred_12 obj_08)
       (pred_12 obj_12)
       (pred_12 obj_04)
       (pred_12 obj_11)
       (pred_12 obj_10)
       (pred_12 obj_18)
       (pred_12 obj_20)
       (pred_12 obj_05)
       (pred_12 obj_17)
       (pred_12 obj_14)

       (pred_4  obj_09 obj_06)
       (pred_4  obj_15 obj_16)
       (pred_5 obj_09 obj_18)
       (pred_5 obj_15 obj_13)
       (pred_7 obj_13)
    )

    (:goal (and
       (pred_5 obj_15 obj_20)
    ))
(:constraints
  (always (not (pred_7 obj_12)))
)
)

; plan
1. (op_2 obj_13 obj_15)
   deleted: (pred_5 obj_15 obj_13) (pred_11)
   added: (pred_10 obj_15)
   goals met: 0 of 1
2. (op_1 obj_13 obj_08)
   deleted: (pred_7 obj_13)
   added: (pred_7 obj_08)
   goals met: 0 of 1
3. (op_1 obj_08 obj_10)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_10)
   goals met: 0 of 1
4. (op_1 obj_10 obj_18)
   deleted: (pred_7 obj_10)
   added: (pred_7 obj_18)
   goals met: 0 of 1
5. (op_1 obj_18 obj_20)
   deleted: (pred_7 obj_18)
   added: (pred_7 obj_20)
   goals met: 0 of 1
6. (op_5 obj_20 obj_15)
   deleted: (pred_10 obj_15)
   added: (pred_11) (pred_5 obj_15 obj_20)
   goals met: 1 of 1
